Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: Keys and their mysterious symbols
fr: Les touches et leurs mystérieux symboles

source: Known limitation:
fr: Limitation connue:

source: LControl (or LCtrl)
fr: LControl (ou LCtrl)

source: Language Syntax
fr: Syntaxe du Langage

source: Later versions of the installer include a link in the bottom-right corner to extract setup files without installing.
fr: Les versions suivantes de l'installateur incluent un lien en bas à droite pour extraire les fichiers d'installation sans réaliser l'installation.

source: Launch Calculator
fr: Lancer la calculatrice

source: Launch My Computer
fr: Lancer Mon Ordinateur

source: Launch default e-mail program
fr: Lancer le programme de courrier électronique (e-mail) par défaut

source: Launch default media player
fr: Lancer le lecteur multimédia par défaut

source: Launch unconditionally, skipping any warning dialogs.
fr: Exécuter inconditionnellement, et ignorer tout message d'avertissement.

source: Leading and trailing `t sequences are no longer discarded
fr: Les séquences de début et de fin `t ne sont plus ignorées

source: Leading and trailing spaces and tabs are ignored.
fr: Les espaces et tabulations au début et à la fin sont ignorés.

source: Learn details about creating, editing and running a script, the tray icon, the main window, command line usage, portability and installer options.
fr: Apprendre les détails pour créer, modifier et exécuter un script, icône de zone de notification, fenêtre principale, utilisation en ligne de commande, portabilité et options d'installation.

source: Learn details about scripts in general, splitting long lines, compiling a script, passing command line parameters, codepage and debugging.
fr: Apprendre les détails sur les scripts en général, découper les lignes longues, compiler un script, passer des paramètres de ligne de commande, page de code et débogage.

source: Learn details about the GNU General Public License v2 used by AutoHotkey.
fr: Pour en apprendre plus sur la licence utilisée par AutoHotkey, GNU General Public License v2.

source: Learn details about the language such as comments, expressions, legacy syntax, commands, control flow statements, structure of a script, etc.
fr: Apprendre les détails du langage comme les commentaires, les expressions, la syntaxe dépassée, les commandes, les instructions de flux de contrôle, la structure d'un script, etc.

source: Learn how to download and install AutoHotkey, to create a script, to use hotkeys and hotstrings, to send keystrokes, to run programs, etc.
fr: Apprendre comment télécharger et installer AutoHotkey, créer un script, utiliser des hotkeys et des hotstrings, envoyer des appuis de touche, lancer des programmes, etc.

source: Learning takes time, the "pros" you encounter did not learn to be masters in just a few hours or days.
fr: Apprendre prend du temps, les "pros" qui peuvent être rencontrés n'ont pas appris en quelques heures ou jours.

source: Left Alt.
fr: La touche Alt de la gauche.

source: Left Control.
fr: La touche Ctrl de la gauche.

source: Left Shift.
fr: La touche Maj de la gauche.

source: Left Win.
fr: La touche Win de la gauche.

source: Legacy Syntax
fr: Syntaxe Dépassée (legacy)

source: Legacy mixed assignment
fr: Affectation dépassée mixte

source: Legacy text assignment
fr: Affectation dépassée de texte

source: Legacy variable assignment
fr: Affectation dépassée de variable

source: Line 1
fr: Ligne 1

source: Line 1 of the text.
fr: Ligne 1 du texte.

source: Line 2
fr: Ligne 2

source: Line 2 of the text.
fr: Ligne 2 du texte.

source: Lines are merged regardless of whether the line actually contains an expression.
fr: Les lignes sont fusionnées qu'elles contiennent une expression ou non.

source: Lines most recently executed - See ListLines.
fr: Lines most recently executed (lignes plus récemment exécutées) - Voir ListLines.

source: List of Keys (Keyboard, Mouse and Joystick) | AutoHotkey
fr: Liste des Touches (Clavier, Souris et Joystick) | AutoHotkey

source: List of Keys (Keyboard, Mouse and Joystick)
fr: Liste des Touches(Clavier, Souris et Joystick)

source: List of keys, mouse buttons and joystick controls
fr: Liste des touches, boutons de la souris et contrôles du joystick

source: Literal percent signs must be escaped by preceding them with an accent/backtick.
fr: Les signes pourcentage littéraux doivent être échappés en les précédant d'un accent grave ou backtick.

source: Literal text in an expression is always enclosed in quote marks.
fr: Dans une expression le texte littéral est toujours entouré de guillemets

source: Long lines can be divided up into a collection of smaller ones to improve readability and maintainability.
fr: Les longues lignes peuvent être divisées en un ensemble de lignes plus courtes pour améliorer la lisibilité et la maintenabilité.

source: LongPath := A_LoopFileFullPath
fr: CheminLong := A_LoopFileFullPath

source: LongPath := A_LoopFileLongPath
fr: CheminLong := A_LoopFileLongPath

source: Look for AutoHotkey.chm or a file that says AutoHotkey and has a yellow question mark on it.
fr: Chercher AutoHotkey.chm ou un fichier intitulé AutoHotkey avec un point d'interrogation jaune dessus.

source: Look for AutoHotkey.ahk in the following directories:
fr: Chercher AutoHotkey.ahk dans les dossiers suivants :

source: Loop %GivenPath%, 1
fr: Loop %CheminDonné%, 1

source: Loop Files, %GivenPath%, FD
fr: Loop Files, %CheminDonné%, FD

source: Loop Parse, rowtext, `t
fr: Loop Parse, texteLigne, `t

source: Loop Statement
fr: Instruction de Boucle

source: Loop variables can also be used outside the body of a loop, such as in a function or subroutine which is called from within a loop.
fr: Les variables de boucle peuvent aussi être utilisées hors du corps d'une boucle, comme dans une fonction ou un sous-programme appelé de l'intérieur d'une boucle.

source: Low impact:
fr: impact faible:

source: Lower the volume
fr: Diminuer le volume

source: Main Window
fr: Fenêtre principale

source: Manually extracting the files to a different directory may help.
fr: L'extraction manuelle des fichiers dans un autre dossier peut aider.

source: Many command parameters do not accept expressions by default.
fr: Beaucoup de paramètres de commande n'acceptent pas les expressions par défaut.

source: Meaning
fr: Signification

source: Meaning the stuff inside can be left out if you don't need them.
fr: C'est-à-dire que ce qui est à l'intérieur peut ne pas être précisé si il n'y en a pas besoin.

source: Meaning, you do not wrap Ctrl or Enter (or any other key) inside curly brackets when making a hotkey.
fr: C'est-à-dire, il n'y a pas à mettre Ctrl ou Enter (ou toute autre touche) entre accolades pour créer une hotkey.

source: Medium impact:
fr: Impact moyen:

source: Member access using a dot (once or in a series), such as ExcelApp.Quit or x.y.z.
fr: L'accès de membre avec un point (une fois ou dans une série), comme ExcelApp.Quit ou x.y.z.

source: Member access using square brackets, such as MyObj[Index], which can have side-effects like a function call.
fr: Les accès de membre avec crochets, comme MonObj[Index], qui peuvent avoir des effets de bord comme l'appel d'une fonction.

source: Method 1:
fr: Méthode 1 :

source: Method 2:
fr: Méthode 2 :

source: Method calls such as MyObj.MyMethod().
fr: Les appels de méthode comme MonObj.MaMethode().

source: Middle or wheel mouse button
fr: Bouton central ou roulette de la souris

source: Mirror (downloads and information):
fr: Mirroir (téléchargements et information) :

source: Miscellaneous
fr: Divers

source: Miscellaneous topics
fr: Sujets divers

source: Modifier Keys
fr: Touches de combinaison

source: More DirectX issues may occur when using PixelSearch, PixelGetColor or ImageSearch.
fr: Davantage de problèmes liés à DirectX peuvent être rencontrés en cas d'utilisation de PixelSearch, PixelGetColor ou ImageSearch.

source: More about locals and globals.
fr: Davantage sur local/global.

source: Most expressions with side-effects can be used this way, so it is generally not necessary to memorise the details of this section.
fr: La plupart des expressions avec effets de bord peuvent être utilisées ainsi, donc il n'est en général pas nécessaire de mémoriser les détails de cette section.

source: Most of the time these constructs are not needed, so in general, variable names should not be enclosed in percent signs within an expression.
fr: La plupart du temps cette syntaxe n'est pas nécessaire, donc en général, les noms de variable ne devraient pas être entre signes pourcentage dans une expression.

source: Most scripts have an effect only while they are running.
fr: La plupart des scripts ont un effet seulement pendant leur exécution.

source: Most such errors can be easily corrected once they are identified.
fr: La plupart de ces erreurs peuvent être facilement corrigées une fois identifiées.

source: Mouse
fr: Souris

source: MsgBox Hello %A_UserName%.
fr: MsgBox Bonjour %A_UserName%.

source: MsgBox This is text.
fr: MsgBox Ceci est du texte.

source: MsgBox %second%
fr: MsgBox %deuxième%

source: MsgBox % second
fr: MsgBox % deuxième

source: MsgBox % "Hello " . A_UserName . "."
fr: MsgBox % "Bonjour " . A_UserName . "."

source: MsgBox % "Hello %A_UserName%."
fr: MsgBox % "Bonjour %A_UserName%."

source: MsgBox % "This is text."
fr: MsgBox % "Ceci est du texte."

source: MsgBox % "This script requires at least 3 parameters but it only received " A_Args.Length() "."
fr: MsgBox % "Ce script nécessite au moins 3 paramètres mais n'en a reçu que " A_Args.Length() "."

source: MsgBox % %second%
fr: MsgBox % %deuxième%

source: MsgBox % Format("Hello {1}.", A_UserName)
fr: MsgBox % Format("Bonjour {1}.", A_UserName)

source: MsgBox % Format("You are using AutoHotkey v{1} {2}-bit.", A_AhkVersion, A_PtrSize*8)
fr: MsgBox % Format("Vous utilisez AutoHotkey v{1} {2}-bit.", A_AhkVersion, A_PtrSize*8)

source: MsgBox % MyArray%A_Index%
fr: MsgBox % MonTableau%A_Index%

source: MsgBox %rownum%:%A_Index% = %A_LoopField%
fr: MsgBox %numeroLigne%:%A_Index% = %A_LoopField%

source: MsgBox Parameter number %n% is %param%.
fr: MsgBox Le paramètre numéro %n% est %param%.

source: MsgBox The case-corrected long path name of file`n%GivenPath%`nis:`n%LongPath%
fr: MsgBox Le chemin long avec casse corrigée du fichier`n%CheminDonné%`nest :`n%CheminLong%

source: MsgBox The page is done loading.
fr: MsgBox La page a fini de charger.

source: MsgBox The wait timed out or the window was closed.
fr: MsgBox L'attente a été trop longue ou la fenêtre a été fermée.

source: MsgBox This script requires at least 3 incoming parameters but it only received %0%.
fr: MsgBox Ce script nécessite au moins 3 paramètres d'entrée mais n'en a reçu que %0%.

source: MsgBox double-press
fr: MsgBox double appui

source: MsgBox's handles commas more consistently
fr: MsgBox gère les virgules de manière plus cohérente

source: MsgBox, %A_ThisHotkey% was pressed.
fr: MsgBox, %A_ThisHotkey% a été enfoncé.

source: MsgBox, %OutputVar%`, That makes me sad.
fr: MsgBox, %VarSortie%`, Cela m'attriste.

source: MsgBox, 4,, Parameter number %A_Index% is %param%.
fr: MsgBox, 4,, Le paramètre numéro %A_Index% est %param%.

source: MsgBox, := This would be an assignment without the comma.
fr: MsgBox, := Ceci serait une affectation sans la virgule.

source: MsgBox, Be careful!
fr: MsgBox, Soyez prudent !

source: MsgBox, Common mistake:
fr: MsgBox, Erreur courante :

source: MsgBox, Content of the edit control:
fr: MsgBox, Contenu du contrôle Edit :

source: MsgBox, Escape!!!!
fr: MsgBox, échap !!!!

source: MsgBox, Hello
fr: MsgBox, Bonjour

source: MsgBox, Hello Run, notepad.exe
fr: MsgBox, Bonjour Run, notepad.exe

source: MsgBox, Hello, Run, notepad.exe
fr: MsgBox, Bonjour, Run, notepad.exe

source: MsgBox, Left:
fr: MsgBox, Gauche :

source: MsgBox, MyVar equals %MyVar%!!
fr: MsgBox, MaVar vaut %MaVar% !!

source: MsgBox, My`, what a shiny new vehicle you have there.
fr: MsgBox, Ouah`, quelle belle voiture neuve vous avez là.

source: MsgBox, Thank you for answering %OutputVar2%`, %OutputVar%!
fr: MsgBox, Merci d'avoir répondu %VarSortie2%`, %VarSortie% !

source: MsgBox, That's an awesome name`, %OutputVar%.
fr: MsgBox, C'est un super nom`, %VarSortie%.

source: MsgBox, The car is really old.
fr: MsgBox, La voiture est vraiment vieille.

source: MsgBox, The time is %A_Hour% o'clock.
fr: MsgBox, Il est %A_Hour% heure(s).

source: MsgBox, There are
fr: MsgBox, Il y a

source: MsgBox, This car is not safe to drive.
fr: MsgBox, Cette voiture n'est pas sûre à conduire.

source: MsgBox, This is some text.
fr: MsgBox, Ceci est du texte.

source: MsgBox, This line is commented out (disabled).
fr: MsgBox, Cette ligne est commentée (désactivée).

source: MsgBox, This line is commented out.
fr: MsgBox, Cette ligne est commentée.

source: MsgBox, We are now 'outside' of the if-statement.
fr: MsgBox, Ici est 'l'extérieur' de l'instruction if.

source: MsgBox, You pressed ALT+Q in Notepad.
fr: MsgBox, Vous avez appuyé sur ALT+Q dans Notepad.

source: MsgBox, You pressed ALT+Q in any window.
fr: MsgBox, Vous avez appuyé sur ALT+Q dans une fenêtre quelconque.

source: MsgBox, You pressed Numpad1 while holding down Numpad0.
fr: MsgBox, Vous avez appuyé sur Numpad1 tout en maintenant Numpad0.

source: MsgBox, You pressed WIN+SPACE in MSPaint!
fr: MsgBox, Vous avez appuyé sur WIN+ESPACE dans MSPaint !

source: MsgBox, You pressed WIN+SPACE in Notepad.
fr: MsgBox, Vous avez appuyé sur WIN+ESPACE dans Notepad.

source: MsgBox, You pressed YES.
fr: MsgBox, Vous avez choisi OUI.

source: MsgBox, You typed btw.
fr: MsgBox, Vous avez écrit btw.

source: MsgBox,, Second, Third
fr: MsgBox,, Deuxième, Troisième

source: Multimedia Keys
fr: Touches Multimedia

source: Multiple conditions cannot be written on the same line (such as with the and operator).
fr: Des conditions multiples ne peuvent pas être écrites sur la même ligne (comme avec l'opérateur and).

source: Multiple hotkeys, multiple hotstrings.
fr: Plusieurs hotkeys, plusieurs hotstrings.

source: Multiple hotkeys/hotstrings per file
fr: Plusieurs hotkeys/hotstrings par fichier

source: Mute the volume
fr: Muet

source: My antivirus program flagged AHK as malware.
fr: Mon programme antivirus a détecté AutoHotkey ou un script compilé comme logiciel malveillant.

source: My antivirus program flagged AutoHotkey or a compiled script as malware.
fr: Mon programme antivirus a détecté AutoHotkey ou un script compilé comme logiciel malveillant.

source: My keypad has a special 000 key.
fr: Mon clavier numérique a une touche spéciale 000.

source: MyArray1 = A
fr: MonTableau1 = A

source: MyArray2 = B
fr: MonTableau2 = B

source: MyArray3 = C
fr: MonTableau3 = C

source: MyFunction(FirstParameter, Second, ByRef Third, Fourth:="")
fr: MaFonction(PremierParamètre, Deuxième, ByRef Troisième, Quatrième:="")

source: MyObject := Array("one", "two", "three", 17)
fr: MonObjet := Array("one", "two", "three", 17)

source: MyObject := ["one", "two", "three", 17]
fr: MonObjet := ["un", "deux", "trois", 17]

source: MyObject.InsertAt(Index, Value1, Value2, Value3...)
fr: MonObjet.InsertAt(Index, Valeur1, Valeur2, Valeur3...)

source: MyObject.NewKey := "Shiny"
fr: MonObjet.NouvelleClef := "Shiny"

source: MyObject.Pop()
fr: MonObjet.Pop()

source: MyObject.Push(Value1, Value2, Value3...)
fr: MonObjet.Push(Valeur1, Valeur2, Valeur3...)

source: MyObject["NewerKey"] := 3.1415
fr: MonObjet["NouvelleClef"] := 3.1415

source: MyScript.ahk
fr: MonScript.ahk

source: MyVar := "Text"
fr: MaVar := "Text"

source: MyVar := "The value of 5 + " MyVar2 " is:
fr: MaVar := "La valeur de 5 + " MaVar2 " est :

source: MyVar := "This is text."
fr: MyVar := "Ceci est du texte."

source: MyVar := 6 + 8 / 3 * 2 - Sqrt(9)
fr: MaVar := 6 + 8 / 3 * 2 - Sqrt(9)

source: MyVar := MyVar2
fr: MaVar := MaVar2

source: MyVar = %MyVar2%
fr: MaVar = %MaVar2%

source: MyVar = %MyVar2% some text %MyVar3%.
fr: MaVar = %MaVar2% du texte %MaVar3%.

source: MyVar = Text
fr: MaVar = Texte

source: MyVar = This is text.
fr: MyVar = Ceci est du texte.

source: NOTE:
fr: REMARQUE:

source: Named If statements allow a command to be written on the same line, but mispelled command names are treated as literal text.
fr: Les instructions If nommées autorisent qu'une commande soit écrite sur la même ligne, mais les noms de commande mal orthographiés sont traités comme du texte littéral.

source: New scripts should use StrSplit() instead, as it creates a normal array.
fr: Les nouveaux scripts devraient utiliser StrSplit() à la place, qui crée un tableau normal.

source: Next Track
fr: Piste suivante

source: No
fr: Non

source: None of the parameters are expressions.
fr: Aucun des paramètres n'est une expression.

source: Normal labels consist of a name followed by a colon.
fr: Les labels normaux sont constitués d'un nom suivi d'un deux-points.

source: Normally if AutoHotkey is installed, right-clicking an AutoHotkey script (.ahk) file should give the following options:
fr: Normalement si AutoHotkey est installé, clic droit sur un fichier de script AutoHotkey (.ahk) devrait afficher les options suivantes :

source: Not Control Flow
fr: Pas du Flux de Contrôle

source: Not all expressions can be used alone on a line.
fr: Toutes les expressions ne peuvent pas être utilisées seules sur une ligne.

source: Not all games allow AHK to send keys and clicks or receive pixel colors.
fr: Tous les jeux ne permettent pas à AutoHotkey d'envoyer des frappes et des clics ou de recevoir les couleurs des pixels.

source: Not indented:
fr: Non indenté :

source: Not only is bypassing these systems in violation of the games policies and could get you banned, they are complex to work around.
fr: Non seulement passer outre ces systèmes est une violation des termes de ces jeux et peut engendrer un ban, il est en plus compliqué de les contourner.

source: Note that hotkey prefix symbols such as ^ (control) and + (shift) are not supported (though GetKeyState can be used as a substitute).
fr: Notez que les symboles de préfixe de hotkey tels que ^ (contrôle) et + (décalage) ne sont pas pris en charge (bien que GetKeyState puisse être utilisé comme substitut).

source: Note that INI files accessed with the standard INI commands do not support UTF-8; they must be saved as ANSI or UTF-16.
fr: A noter que les fichiers INI auxquels accèdent les commandes INI standards ne sont pas compatibles avec UTF-8 ; ils doivent être enregistrés en ANSI ou UTF-16.

source: Note that as labels have no effect when reached during normal execution, in this example a MsgBox would be shown twice:
fr: A noter que comme les labels n'ont aucun effet quand ils sont atteints en exécution normale, dans cet exemple une MsgBox serait affichée deux fois :

source: Note that depending on your system settings the ".ahk" part may be hidden, but the file should have an icon like
fr: Selon les paramètres du système, la partie ".ahk" peut être cachée, mais le fichier devrait avoir une icône comme

source: Note that if you use auto-included function libraries, AutoHotkey.exe and the Lib folder must be up one level from Ahk2Exe.exe (e.g. \AutoHotkey.exe vs \Compiler\Ahk2Exe.exe).
fr: A noter qu'en cas d'utilisation de bibliothèques de fonctions auto-incluses, AutoHotkey.exe et le dossier Lib doivent être un niveau au-dessus de Ahk2Exe.exe (par exemple \AutoHotkey.exe vs \Compiler\Ahk2Exe.exe).

source: Note that mixed-type parameters such as SetTimer's second parameter, which sometimes accepts a number and sometimes accepts a string such as On or Off, are actually Text parameters, and as such, they do not accept expressions unless the percent prefix is used.
fr: A noter que les paramètres de type mixte comme le deuxième paramètre de SetTimer, qui accepte parfois un nombre et parfois une chaîne de caractères comme On ou Off, sont des paramètres Texte, et en tant que tels, n'acceptent pas d'expressions sauf si le préfixe pourcentage est utilisé.

source: Note that the sleep key on some keyboards might not work with this.
fr: Notez que la touche de veille de certains claviers peut ne pas fonctionner avec cela.

source: Note that this also causes any programs launched by the script to run as administrator, and may require the user to accept an approval prompt when launching the script.
fr: Ceci a aussi pour effet que tout programme lancé par le script sera exécuté en tant qu'administrateur, et peut afficher à l'utilisateur une fenêtre de confirmation au lancement du script.

source: Note that this applies only to script files loaded by AutoHotkey, not to file I/O within the script itself.
fr: A noter que ceci ne s'applique qu'aux fichiers chargés par AutoHotkey, pas aux opérations d'entrée-sortie effectuées sur des fichiers au sein du script même.

source: Note that this functionality is disabled for compiled scripts.
fr: A noter que cette fonctionnalité est désactivée pour les scripts compilés.

source: Notice that the bottom line contains FileAppend's last parameter after the closing parenthesis.
fr: A noter que la ligne du bas contiens le dernier paramètre de FileAppend après la parenthèse fermante.

source: Now, to make Numpad0 send a real Numpad0 keystroke whenever it wasn't used to launch a hotkey such as the above, add the following hotkey:
fr: Maintenant, pour que Numpad0 envoie une vraie frappe Numpad0 dès que la touche n'a pas été utilisée pour activer une hotkey comme celle ci-dessus, ajouter la hotkey suivante :

source: Number
fr: Nombre

source: Number := 6
fr: Nombre := 6

source: NumberOfRemovedKeys := MyObject.Delete(FirstKey, LastKey)
fr: NombreDeClefsEnlevees := MonObjet.Delete(PremiereClef, DerniereClef)

source: NumberOfRemovedKeys := MyObject.RemoveAt(Index, Length)
fr: NombreDeClefsEnlevees := MonObjet.RemoveAt(Index, Longueur)

source: Numbers may be automatically converted to strings (text) and vice versa, depending on the situation.
fr: Il est possible que les nombres soient automatiquement convertis en chaîne de caractères (texte) et vice versa, selon la situation.

source: Numeric Parameters
fr: Paramètres Numériques

source: Numeric parameters accept a literal number or an expression, and can be identified by phrasing like "This parameter can be an expression."
fr: Les paramètres numériques acceptent un nombre littéral ou une expression, et peuvent être identifiés par des formulations comme "Ce paramètre peut être une expression."

source: Numeric parameters allow and ignore the percent prefix.
fr: Les paramètres numériques autorisent et ignorent le préfixe pourcentage.

source: Numpad Keys
fr: Touches du Pavé Numérique

source: Numpad0 & Numpad1::MsgBox, You pressed Numpad1 while holding down Numpad0.
fr: Numpad0 & Numpad1::MsgBox, Vous avez appuyé sur Numpad1 tout en maintenant Numpad0 enfoncée.

source: Object function
fr: Fonction Object (objet)

source: Objects
fr: Objets

source: Of course, you can always open your text editor first and then open the script as you would any other text file.
fr: Bien sûr, il est toujours possible de commencer par ouvrir un éditeur de texte puis d'ouvrir le script comme n'importe quel autre fichier texte.

source: Official website (was offline in March 2016):
fr: Site web officiel (hors-ligne en Mars 2016) :

source: Omits spaces and tabs at the beginning of each line.
fr: Ignore les espaces et les tabulations au début de chaque ligne.

source: On Windows 7 and later, taskbar buttons for multiple scripts are automatically grouped together or combined into one button by default.
fr: A partir de Windows 7, les boutons en barre des tâches pour plusieurs scripts sont par défaut automatiquement regroupés ou combinés en un bouton.
